#include "俄罗斯方块头文件.h"

int main(void) {
	Welcome_interface();
	Game_background();
	new_square();
	Sleep(500);
	while (1) {
		Drop_Square();//生成掉落方块
		//消除游戏区满行格子,并更新等级与分数
		Eliminate();
	}
	closegraph();//关闭图形界面,释放资源
	system("pause");
	return 0;
}
/*****************************************************************
*总结:
*1.项目需求必须要明确.
*2.开发前必须要构思流程并要画出来.
*---------------------------------------------------------------
*3.变量类型必须要对应,防止丢失精度.
*如:double类型通过运算变为int或者其它类型,
*而需要用到时,如像素X轴本来是135.4的,成为int类型就变为了135了.
*从而导致后面的判断以及运算和维护增加了难度.
*---------------------------------------------------------------
*4.开发过程必须注释及写文档,更新流程图.
*5.像素X轴Y轴等此类,尽量构思好,和尽量运算及偏移等能和int类型匹配.
*6.出现不可能的bug,那么函数之间参数必须检查清楚.
*7.每次画图或者写字必须要设置需要的背景色及颜色.
*8.画图和写字是覆盖,覆盖到舞台上的.图与图之间相隔为1像素(紧连的话会消失那1像素)
*******************************************************************/